---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LoopIntersectPath3d
source: html/10eebfce-7ae3-ff5c-aa56-8dac2202befb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LoopIntersectPath3d Property

Lines cannot intersect each other. The highlighted lines currently intersect.

## Syntax (C#)
```csharp
public static FailureDefinitionId LoopIntersectPath3d { get; }
```